{"_name_or_path": "prajjwal1/bert-tiny", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 128, "id2label": {"0": "O", "1": "B-location", "2": "I-location", "3": "B-organisation", "4": "I-organisation", "5": "B-person", "6": "I-person", "7": "B-misc", "8": "I-misc"}, "initializer_range": 0.02, "intermediate_size": 512, "label2id": {"O": "0", "B-location": "1", "I-location": "2", "B-organisation": "3", "I-organisation": "4", "B-person": "5", "I-person": "6", "B-misc": "7", "I-misc": "8"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 2, "num_hidden_layers": 2, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.40.1", "type_vocab_size": 2, "use_cache": true, "vocab_size": 30522}